/* Задание на урок:

1) Автоматизировать вопросы пользователю про фильмы при помощи цикла

2) Сделать так, чтобы пользователь не мог оставить ответ в виде пустой строки,
отменить ответ или ввести название фильма длинее, чем 50 символов. Если это происходит - 
возвращаем пользователя к вопросам опять

3) При помощи условий проверить  personalMovieDB.count, и если он меньше 10 - вывести сообщение
"Просмотрено довольно мало фильмов", если от 10 до 30 - "Вы классический зритель", а если больше - 
"Вы киноман". А если не подошло ни к одному варианту - "Произошла ошибка"

4) Потренироваться и переписать цикл еще двумя способами*/

'use strict';

// Код возьмите из предыдущего домашнего задания

//---------------------------------------------------------------------------------
const numberOfFilms = +prompt('How many films have you seen', '');

const personalMovieDB = {
   count: numberOfFilms,
   movies: {},
   actors: {},
   genres: [],
   privat: false
};

//Ми можемо видалити цю частину якщо в нас є цикл який прописаний нижче:
// const a = prompt('Один з останніх фільмів які Ви переглядали?', ''),
//       b = prompt('На скільки Ви його оцінюєте?', ''),
//       c = prompt('Один з останніх фільмів які Ви переглядали?', ''),
//       d = prompt('На скільки Ви його оцінюєте?', '');

// personalMovieDB.movies[a] = b;
// personalMovieDB.movies[c] = d;


for(let i = 0; i < 2; i++) {
   a = prompt('Один з останніх фільмів які Ви переглядали?', ''),
   b = prompt('На скільки Ви його оцінюєте?', ''); // поставив крапку з комою!
}
//коли користувач обирає "відміну" - консоль виведе null
console.log(personalMovieDB);
//--------------------------------------------------------------------------------

